"""
    Задача 2: Найдите сумму цифр трехзначного числа. 
    123 -> 6 (1 + 2 + 3)
    100 -> 1 (1 + 0 + 0)
"""

n = 100
result = (n // 100) + ((n // 10) % 10) + (n % 10)

print(result)
